vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/devices/MCXA156/drivers/fsl_i3c.c
            /* Ready to handle next device. */
            mctrlDone = false;
            rxSize    = 0;
        }
        else
        {
            /* Intentional empty */
        }
    } while ((status & (uint32_t)kI3C_MasterCompleteFlag) != (uint32_t)kI3C_MasterCompleteFlag);

    /* Master stops DAA if slave device number exceeds the prepared address number. */
    if (result == kStatus_I3C_SlaveCountExceed)
    {
        /* Send the STOP signal */
        base->MCTRL = (base->MCTRL & ~(I3C_MCTRL_REQUEST_MASK | I3C_MCTRL_DIR_MASK | I3C_MCTRL_RDTERM_MASK)) |
                      I3C_MCTRL_REQUEST(kI3C_RequestEmitStop);
    }

    /* Set back initial baud rate after DAA is over. */
    if (daaBaudRate != NULL)
    {
        base->MCONFIG = masterConfig;
    }

    /* Clear all flags. */
    I3C_MasterClearErrorStatusFlags(base, (uint32_t)kMasterErrorFlags);
    I3C_MasterClearStatusFlags(base, (uint32_t)kMasterClearFlags);

    /* Enable I3C IRQ sources while we configure stuff. */
    I3C_MasterEnableInterrupts(base, enabledInts);

    return result;
}

/*!
 * brief Get device information list after DAA process is done.
 *
 * param base The I3C peripheral base address.
 * param[out] count The pointer to store the available device count.
 * return Pointer to the i3c_device_info_t array.
 */
i3c_device_info_t *I3C_MasterGetDeviceListAfterDAA(I3C_Type *base, uint8_t *count)
{
    assert(NULL != count);

    uint32_t instance = I3C_GetInstance(base);

    *count = usedDevCount[instance];

    return devList[instance];
}

/*!
 * brief Clear the global device count which represents current devices number on the bus.
 * When user resets all dynamic addresses on the bus, should call this API.
 *
 * param base The I3C peripheral base address.
 */
void I3C_MasterClearDeviceCount(I3C_Type *base)
{
    usedDevCount[I3C_GetInstance(base)] = 0;
}

/*!
 * @brief introduce function I3C_MasterClearFlagsAndEnableIRQ.
 *
 * This function was used of Clear all flags and Enable I3C IRQ sources for @param *base.
 *
 * @param base The I3C peripheral base address.
 */
static void I3C_MasterClearFlagsAndEnableIRQ(I3C_Type *base)
{
    /* Clear all flags. */
    I3C_MasterClearStatusFlags(base, (uint32_t)kMasterClearFlags);
    /* Enable I3C IRQ sources. */
    I3C_MasterEnableInterrupts(base, (uint32_t)kMasterIrqFlags);
}

/*!
 * @brief Polling the START operation.
 *
 * This function polls the START operation until it's over and check the status.
 *
 * @param base The I3C peripheral base address.
 * @param type The bus type to use in this transaction.
 * @param address 7-bit slave device address, in bits [6:0].
 * @param dir Master transfer direction, either #kI3C_Read or #kI3C_Write. This parameter is used to set
 *      the R/w bit (bit 0) in the transmitted slave address.
 * @param tSize Read terminate size for the followed read transfer, limit to 255 bytes.
 * @retval #kStatus_Success Data was received successfully.
 * @retval #kStatus_I3C_Busy Another master is currently utilizing the bus.
 * @retval #kStatus_I3C_Nak The slave device sent a NAK in response to a byte.
 */
static status_t I3C_MasterStartPolling(
    I3C_Type *base, i3c_bus_type_t type, uint8_t address, i3c_direction_t dir, uint8_t tSize)
{
    status_t result = kStatus_Success;

    result = I3C_MasterRepeatedStartWithRxSize(base, type, address, dir, tSize);
    if (result != kStatus_Success)
    {
        return result;
    }

    result = I3C_MasterWaitForCtrlDone(base, false);
    if (result != kStatus_Success)
    {
        return result;
    }

    if (0UL != (I3C_MasterGetStatusFlags(base) & (uint32_t)kI3C_MasterArbitrationWonFlag))
    {
        result = kStatus_I3C_IBIWon;
    }

    return result;
}

/*!
 * @brief Prepare the blocking transfer.
 *
 * This function prepares the configuration for blocking transfer.
 *
 * @param base The I3C peripheral base address.
 * @param transfer Pointer to the transfer structure.
 * @retval #kStatus_Success Data was received successfully.
 * @retval #kStatus_I3C_Busy Another master is currently utilizing the bus.
 * @retval #kStatus_I3C_Nak The slave device sent a NAK in response to a byte.
 */
static status_t I3C_MasterTransferPrepare(I3C_Type *base, i3c_master_transfer_t *transfer)
{
    status_t result           = kStatus_Success;
    i3c_direction_t direction = transfer->direction;
    uint32_t subaddressRemaining;
    uint8_t tSize;

    if (transfer->busType != kI3C_TypeI3CDdr)
    {
        direction = (0UL != transfer->subaddressSize) ? kI3C_Write : transfer->direction;
    }
    assert(!((0UL != (transfer->flags & (uint32_t)kI3C_TransferNoStartFlag)) && (direction == kI3C_Read)));

    if (0UL != (transfer->flags & (uint32_t)kI3C_TransferStartWithBroadcastAddr))
    {
        /* Issue 0x7E as start. */
        result = I3C_MasterStartPolling(base, transfer->busType, 0x7E, kI3C_Write, 0);
        if (result != kStatus_Success)
        {
            return result;
        }
    }

    if (0UL == (transfer->flags & (uint32_t)kI3C_TransferNoStartFlag))
    {
        tSize  = (0U != (transfer->flags & (uint32_t)kI3C_TransferRxAutoTermFlag)) ? (uint8_t)transfer->dataSize : 0U;
        result = I3C_MasterStartPolling(base, transfer->busType, transfer->slaveAddress, direction, tSize);
        if (result != kStatus_Success)
        {
            return result;
        }
    }

    /* Subaddress, MSB first. */
    if (0U != transfer->subaddressSize)
    {
        subaddressRemaining = transfer->subaddressSize;
        while (0UL != subaddressRemaining--)
        {
            uint8_t subaddressByte = (uint8_t)((transfer->subaddress >> (8UL * subaddressRemaining)) & 0xFFUL);

            result = I3C_MasterWaitForTxReady(base, 1U);
            if (kStatus_Success != result)
            {
                return result;
            }

            if ((0UL == subaddressRemaining) && ((transfer->direction == kI3C_Read) || (0UL == transfer->dataSize)) &&
                (transfer->busType != kI3C_TypeI3CDdr))
            {
                base->MWDATABE = subaddressByte;
                result         = I3C_MasterWaitForComplete(base, false);
                if (kStatus_Success != result)
                {
                    return result;
                }
            }
            else
            {
                base->MWDATAB = subaddressByte;
            }
        }

